In [1]:
from pandas import read_csv

In [2]:
df = read_csv('discount_prices.csv')

In [3]:
df.head()

                 Id    Category   Price Discounted Price
0  e22aaee02e2d5dbd  Category A  $81.63           $44.90
1  16bcd69f3197adfd  Category A  $97.44           $51.64
2  52245827900f309c  Category D  $77.33           $40.21
3  15037e2079fc7fe8  Category A  $36.55           $31.43
4  a7789bd9533de8fa  Category D  $50.34           $47.32

In [6]:
df['Price'] = (df['Price'].replace( '[\$,)]','', regex=True )
                   .replace( '[(]','-',   regex=True ).astype(float))

In [7]:
df['Discounted Price'] = (df['Discounted Price'].replace( '[\$,)]','', regex=True )
                   .replace( '[(]','-',   regex=True ).astype(float))

In [13]:
df['discount_amount'] = df['Price'] - df['Discounted Price']

In [14]:
df['discount_rate'] = df['discount_amount'] / df['Price']

In [15]:
df.head()

,Id,Category,Price,Discounted Price,Discounted,discount_amount,discount_rate
0,e22aaee02e2d5dbd,Category A,81.63,44.90,36.73,36.73,0.449957
1,16bcd69f3197adfd,Category A,97.44,51.64,45.80,45.80,0.470033
2,52245827900f309c,Category D,77.33,40.21,37.12,37.12,0.480021
3,15037e2079fc7fe8,Category A,36.55,31.43,5.12,5.12,0.140082
4,a7789bd9533de8fa,Category D,50.34,47.32,3.02,3.02,0.059992

In [16]:
df.groupby(['Category']).mean()

,Price,Discounted Price,Discounted,discount_amount,discount_rate
Category,,,,,
Category A,54.081022,40.835401,13.245620,13.245620,0.244529
Category B,52.776803,39.476352,13.300451,13.300451,0.252956
Category C,51.692232,38.252277,13.439955,13.439955,0.258875
Category D,55.354806,41.645620,13.709186,13.709186,0.248537